var nameList = [
        //girl
            'Анна Па******',
            'Алина Ер******',
            'Александра Ло********',
            'Елена Бы******',
            'Марина Ел******',
            'Анна Мо*******',
            'Ксения Кр********',
            'Алена Бо******',
            'Виктория Ка********',
            'Маргарита Бе******',
            'Анна Ры******',
            'Алла Кр******',
            'Евгения Ко********',
            'Антонина Пе*****',
            'Ирина Со*******',
            'Валентина Бу****',
            'Вика Др****',
            'Валерия Во****',
            'Кристина Со******',
            'Наталья Го******',
            'Катерина Ля******',
            'Анастасия Ле***',
            'Наталья Ло******',
            'Вероника Ан*********',
            'Викуся Пр***',
            'Василиса Ма*********',
            'Виктория Ни****',
            'Оля Са*******',
            'Анастасия Во******',
            //man
            'Валерий Фе********',
            'Владислав Ко****',
            'Владимир Ма****',
            'Валентин Ди****',
            'Иван Ба********',
            'Вячеслав Ку******',
            'Михаил Ро****',
            'Сергей Во****',
            'Дмитрий Де****',
            'Вячеслав Шу******',
            'Дима Ад****',
            'Евгений Ма****',
            'Виталий Ми**',
            'Влад Бу****',
            'Иван Гр****',
            'Алексей Ре****',
            'Владимир Дм******',
            'Вадим Тр****',
            'Вадим Га****',
            'Евгений Го****',
            'Влад Че****',
            'Владислав Ни********',
            'Виктор Че****',
            'Джавид Ма******',
            'Олег Як****',
            'Василий Кр********',
            'Антон Ма******',
            'Иван Ма******',
            'Василий Гу****'
    ],
    NameCount = nameList.length - 1,
    $nameWrap = $('.js-show-name'),
    $name = $('.js-name');
//
function showName(){
        setTimeout(function(){
                $nameWrap.delay(17000);
        }, 17000);
}

function setNameToMessage (index){
        $name.text(nameList[index])
}

(function init () {
        setTimeout(function () {
                var randomNameIndex = (Math.random() * NameCount).toFixed(0);
                setNameToMessage(+randomNameIndex);
                showName();
                init();
        }, 17000);
})();